validation/solid/halfCell/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.002  0.00  -0.002)
    ( 0.002  0.00  -0.002)
    ( 0.002  0.002 -0.002)
    ( 0.002  0.01  -0.002)
    (-0.002  0.01  -0.002)
    (-0.002  0.002 -0.002)
    (-0.002  0.00   0.002)
    ( 0.002  0.00   0.002)
    ( 0.002  0.002  0.002)
    ( 0.002  0.01   0.002)
    (-0.002  0.01   0.002)
    (-0.002  0.002  0.002)
);

blocks
(
    hex (0 1 2 5 6 7 8 11) (1 100 1) simpleGrading (1 1 1)
    hex (5 2 3 4 11 8 9 10) (1 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom
    {
        type patch;
        faces
        (
            (0 1 7 6)
        );
    }
    sides
    {
        type symmetry;
        faces
        (
            (1 2 8 7)
            (2 3 9 8)
            (0 5 11 6)
            (5 4 10 11)
        );
    }
    frontAndBack
    {
        type symmetry;
        faces
        (
            (0 1 2 5)
            (6 7 8 11)
            (5 2 3 4)
            (11 8 9 10)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 3 9 10)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
