validation/solid/halfCell/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    bottom
    {
        type            patch;
        nFaces          1;
        startFace       199;
    }
    sides
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          400;
        startFace       200;
    }
    frontAndBack
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          400;
        startFace       600;
    }
    top
    {
        type            patch;
        nFaces          1;
        startFace       1000;
    }
)

// ************************************************************************* //
